src/main/resources/xml/trainingServer/getRentalByStartDate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:my="my-namespace">
   <soapenv:Header/>
   <soapenv:Body>
      <my:getRentalByStartDateRequest>
         <my:rental_start_date></my:rental_start_date>
      </my:getRentalByStartDateRequest>
   </soapenv:Body>
</soapenv:Envelope>
